In [1]:
import pandas as pd
import os
import datetime

In [9]:
zips=['36502','39466','39452']

In [7]:
zip_county_nielsen=pd.read_excel("/home/jian/Docs/Geo_mapping/Zips by DMA by County16-17 nielsen.xlsx",
                                 skiprows=1,usecols=[0,10])
zip_county_nielsen.head(2)

   CODE        Unnamed: 10
0   501  SUFFOLK, NEW YORK
1   544  SUFFOLK, NEW YORK

In [10]:
zip_county_nielsen[zip_county_nielsen['CODE'].isin(zips)].sort_values("CODE")

        CODE               Unnamed: 10
18081  36502          BALDWIN, ALABAMA
18082  36502         ESCAMBIA, ALABAMA
18083  36502           MONROE, ALABAMA
20168  39452      JACKSON, MISSISSIPPI
20169  39452        PERRY, MISSISSIPPI
20170  39452       GEORGE, MISSISSIPPI
20171  39452       GREENE, MISSISSIPPI
20190  39466      HANCOCK, MISSISSIPPI
20191  39466  PEARL RIVER, MISSISSIPPI